src/cf/src/Catalogs/ШаблоныПлановыхТрудозатрат/ШаблоныПлановыхТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПлановыхТрудозатрат</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПользователя</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>Повторять</name>
      <type>
        <types>EnumRef.ПовторятьНедель</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ПовторятьНедель/ПовторятьНедель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПовторятьНедель</name>
  <enumValues>
    <name>РазВНеделю</name>
  </enumValues>
  <enumValues>
    <name>РазВДвеНедели</name>
  </enumValues>
  <enumValues>
    <name>ПервуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ВторуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ТретьюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ЧетвертуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ВторуюЧетвертуюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>ПервуюТретьюНеделюМесяца</name>
  </enumValues>
  <enumValues>
    <name>КаждыйДень</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыРаботПоЗадачам/ТипыРаботПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРаботПоЗадачам</name>
  <enumValues>
    <name>ФормированиеТехническогоРешения</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Документирование</name>
  </enumValues>
  <enumValues>
    <name>БизнесТестирование</name>
  </enumValues>
  <enumValues>
    <name>ПереносИзмененийВПродуктивнуюСистему</name>
  </enumValues>
  <enumValues>
    <name>Сопровождение</name>
  </enumValues>
  <enumValues>
    <name>Совещание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ШаблоныПлановыхТрудозатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СтрШаблон(НСтр("ru = '[%1]%2'"), Исполнитель, КраткоеНаименование);
	
	ДатаРедактирования = ТекущаяДатаСеанса();
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Включен = Истина;
	Исполнитель = Пользователи.ТекущийПользователь();
	
	НовСтрока = ДниНедели.Добавить();
	НовСтрока.Повторять = Перечисления.ПовторятьНедель.РазВНеделю;
	НовСтрока.ДеньНедели = Перечисления.ДниНедели.Понедельник;
	НовСтрока.ТипРаботы = Перечисления.ТипыРаботПоЗадачам.Сопровождение;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
